/* 6 Напишите функцию, которая принимает массив объектов и функцию
для сравнения элементов. Функция должна возвращать новый массив,
содержащий только последние уникальные элементы согласно
предоставленной функции сравнения. Функция сравнения: Эта функция
принимает два аргумента (два объекта из массива) и возвращает true,
если они считаются эквивалентными для целей уникальности, и false в
противном случае. */

function getObjArray (arr) {

    let currentArray = arr;
    let newArray = [];

    return newArray;
}